fds/src/test/resources/UBPRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <addr:To xmlns:addr="http://www.w3.org/2005/08/addressing">http://localhost:8080/fds/workflow/examples/AbsenceRequest</addr:To>
        <addr:Action xmlns:addr="http://www.w3.org/2005/08/addressing">http://www.example.com/AbsenceRequest/AbsenceRequest_To_Manager/AbsenceRequest_To_Manager_PortType/Receive_Absence_Request--006</addr:Action>
        <addr:ReplyTo xmlns:addr="http://www.w3.org/2005/08/addressing">
            <addr:Address>http://10.10.2.134:8080/ode/processes/axis_service_for_AbsenceRequest_To_Manager_Service__AbsenceRequest_To_Manager_Http_8526536a-496e-4f0b-82c0-3a9071c808b5-4/</addr:Address>
        </addr:ReplyTo>
        <addr:MessageID xmlns:addr="http://www.w3.org/2005/08/addressing">uuid:8526536a-496e-4f0b-82c0-3a9071c808b5-5</addr:MessageID>
        <odesession:callback xmlns:odesession="http://www.apache.org/ode/type/session">
            <addr:Address xmlns:addr="http://www.w3.org/2005/08/addressing">http://localhost:8080/ode/processes/AbsenceRequest/Manager_To_AbsenceRequest</addr:Address>
            <odesession:session>8526536a-496e-4f0b-82c0-3a9071c808b5-2</odesession:session>
        </odesession:callback>
        <intalio:callback xmlns:intalio="http://www.intalio.com/type/session">
            <addr:Address xmlns:addr="http://www.w3.org/2005/08/addressing">http://localhost:8080/ode/processes/AbsenceRequest/Manager_To_AbsenceRequest</addr:Address>
            <intalio:session>8526536a-496e-4f0b-82c0-3a9071c808b5-2</intalio:session>
        </intalio:callback>
    </soapenv:Header>
    <soapenv:Body>
        <createTaskRequest xmlns="http://www.intalio.com/workflow/forms/AbsenceRequest/AbsenceRequest">
            <AbsenceRequest:taskMetaData xmlns:AbsenceRequest="http://www.intalio.com/workflow/forms/AbsenceRequest/AbsenceRequest">
                <AbsenceRequest:description>Examples - Absence Approval</AbsenceRequest:description>
                <AbsenceRequest:processId>64ddc14c-9aab-4605-9e93-dd35ed011f0a</AbsenceRequest:processId>
                <AbsenceRequest:userOwner />
                <AbsenceRequest:roleOwner>examples\manager</AbsenceRequest:roleOwner>
                <AbsenceRequest:formUrl>http://localhost:8080/wds/AbsenceRequest/AbsenceApproval.xform</AbsenceRequest:formUrl>
                <AbsenceRequest:userProcessEndpoint>http://localhost:8080/ode/processes/AbsenceRequest/Manager_To_AbsenceRequest</AbsenceRequest:userProcessEndpoint>
                <AbsenceRequest:userProcessNamespaceURI>http://www.intalio.com/workflow/forms/AbsenceRequest/AbsenceRequest</AbsenceRequest:userProcessNamespaceURI>
                <AbsenceRequest:userProcessCompleteSOAPAction>http://www.example.com/AbsenceRequest/Manager_To_AbsenceRequest/Manager_To_AbsenceRequest_PortType/Receive_Manager_Approval</AbsenceRequest:userProcessCompleteSOAPAction>
            </AbsenceRequest:taskMetaData>
            <AbsenceRequest:taskInput xmlns:AbsenceRequest="http://www.intalio.com/workflow/forms/AbsenceRequest/AbsenceRequest">
                <AbsenceRequest:input formUrl="/AbsenceRequest/AbsenceRequest.xform" user="examples\msmith">
                    <request>
                        <employee>
                            <name>Michael Smith</name>
                            <phone>+1(650)596-1800</phone>
                            <email>msmith@examples.intalio.com</email>
                        </employee>
                        <details>
                            <request>
                                <from>2005-12-05</from>
                                <to>2005-12-09</to>
                                <type />
                                <hours>40</hours>
                            </request>
                            <request>
                                <from>2006-02-06</from>
                                <to>2006-02-10</to>
                                <type />
                                <hours>40</hours>
                            </request>
                        </details>
                        <contactWhileAway>
                            <name>Emily Williams</name>
                            <phone>+1(650)596-1800</phone>
                            <email>ewilliams@examples.intalio.com</email>
                        </contactWhileAway>
                        <notes>This is sample data for this form.</notes>
                    </request>
                </AbsenceRequest:input>
            </AbsenceRequest:taskInput>
        </createTaskRequest>
    </soapenv:Body>
</soapenv:Envelope>
